{"data":[{"author_id":"1410104635","conversation_id":"1497344748360806400","text":"@walidgellad You can make your own decisions obviously but these guidelines seem to be tailored to Omicron. You think it should be otherwise?","created_at":"2022-02-26T01:18:17.000Z","in_reply_to_user_id":"2460564014","id":"1497380465669558274"},{"author_id":"1465694844110573588","conversation_id":"1497344748360806400","text":"@walidgellad It's not one's personal risk of getting COVID. It should one's personal risk of getting very sick with COVID. Getting COVID is fine and not worth preventing if you are not going to get very sick with it, and this is what CDC is trying to recognize.","created_at":"2022-02-25T23:25:56.000Z","in_reply_to_user_id":"2460564014","id":"1497352190070968324"},{"author_id":"1465694844110573588","conversation_id":"1497344748360806400","text":"@walidgellad Depends what is transmitting. A high-level of community transmission of a very weak variant that does not send people to hospitals should be green. I am glad CDC recognizes that.","created_at":"2022-02-25T23:22:39.000Z","in_reply_to_user_id":"2460564014","id":"1497351365231661056"},{"author_id":"1281312463","conversation_id":"1497344748360806400","text":"@walidgellad I'm more upset about the long tail, where the situation is much improved, risk is way back down, but hospital numbers (especially in rural areas) are still too high per 100K. https://t.co/sjQ4kACtwh","created_at":"2022-02-25T23:13:26.000Z","in_reply_to_user_id":"2460564014","id":"1497349046104731651"},{"author_id":"2460564014","conversation_id":"1497344748360806400","text":"@KelleyKga agree. It's set up so that a community can mask before all heck  breaks loose and hospitals are out of beds, but not a good measure of when a surge is coming or to determine your own personal risk, if you care about avoiding covid.","created_at":"2022-02-25T23:11:50.000Z","in_reply_to_user_id":"1281312463","id":"1497348643719770113"},{"author_id":"1281312463","conversation_id":"1497344748360806400","text":"@walidgellad I made the same argument. Hospitalizations also stay high well after the situation improves. It feels more like masks are being used as a punishment for having a surge than anything else.  https://t.co/gKyu7RkVy6","created_at":"2022-02-25T23:08:19.000Z","in_reply_to_user_id":"2460564014","id":"1497347758126206976"},{"author_id":"325804520","conversation_id":"1497344748360806400","text":"@walidgellad The whole country needs to sidestep relying on people and set up wastewater testing in-real time.  It'll be more reliable than a mix of delayed or unavailable pcr lab data and underreporting because people are testing at home or are asymptomatic.","created_at":"2022-02-25T23:06:59.000Z","in_reply_to_user_id":"2460564014","id":"1497347424053915652"},{"author_id":"2460564014","conversation_id":"1497344748360806400","text":"The best measure of how much community transmission there is....is how much community transmission there is. \n\nThat, for me, tells me what I'm going to do to address my particular risk situation. Not whether hospitals are full.\n\nSo I won't use it to make my decisions.","created_at":"2022-02-25T23:04:14.000Z","in_reply_to_user_id":"2460564014","id":"1497346729611608070"},{"author_id":"1120696977593909248","conversation_id":"1497344748360806400","text":"@walidgellad Even cases are too late a metric. Should be based on wastewater levels.","created_at":"2022-02-25T23:02:22.000Z","in_reply_to_user_id":"2460564014","id":"1497346260277231618"},{"author_id":"2460564014","conversation_id":"1497344748360806400","text":"Hospitalizations are way too late a metric, especially in a population heavily vaccinated or if surge hits young people first. \n\nIt's fine for thinking about burden on health resources in a community, but I would not use it as a measure of one's personal risk of getting covid.","created_at":"2022-02-25T22:58:44.000Z","in_reply_to_user_id":"2460564014","id":"1497345344161689604"}],"meta":{"newest_id":"1497380465669558274","oldest_id":"1497345344161689604","result_count":10}}