{"data":[{"author_id":"2809151731","in_reply_to_user_id":"2829248853","id":"1498047642424823809","text":"@Painthisice Gorgeous 😍","created_at":"2022-02-27T21:29:24.000Z","conversation_id":"1497670154615984134"},{"author_id":"1583002158","in_reply_to_user_id":"1583002158","id":"1497825867065663489","text":"@Painthisice dennoch solange du deinen Traum verfolgts kannst du es schaffen 🤞🏼\nVerlier nicht die Hoffnung, den aus Hoffnung entsteht Kraft.\nwenn du doch mal fallen solltest, reiche ich dir Hand helfe dir wie ich nur kann den dass ist was mir manchmal alle brauchen.","created_at":"2022-02-27T06:48:09.000Z","conversation_id":"1497670154615984134"},{"author_id":"1583002158","in_reply_to_user_id":"1583002158","id":"1497824804996632581","text":"@Painthisice Ich bin selbst ein Gebrochener Junger Kerl der oft zu tief in seinen Gedanken schwebt, ich weiß manchmal nicht wohin mit selbst und fühle mich verloren und verängstigt.\nGefühle sind für mich immer eine Achterbahn mit unendlich loopings aus Herz und verstreute Gedanken.","created_at":"2022-02-27T06:43:56.000Z","conversation_id":"1497670154615984134"},{"author_id":"1583002158","in_reply_to_user_id":"1583002158","id":"1497822495461847042","text":"@Painthisice Sie konnte vieles und jenes einfach herbei zaubern könnte man behaupten, eine Hürde hat sie immer versucht zu überwinden und ist noch stärker daraus geworden.\nLeider hat die Depression den Kampf gewonnen und die letze schlacht die sie geführt hat nur ein Loch hinterlassen.","created_at":"2022-02-27T06:34:45.000Z","conversation_id":"1497670154615984134"},{"author_id":"1583002158","in_reply_to_user_id":"1583002158","id":"1497821563982389248","text":"@Painthisice Sie war eine kluge Frau, sie war immer neugierig und hat sich immer wieder neu gefunden.\nDas habe ich an meine Mutter immer bewundert sie, nichts war ihr zu schade und hat es immer mit allen Mitteln versucht.","created_at":"2022-02-27T06:31:03.000Z","conversation_id":"1497670154615984134"},{"author_id":"1583002158","in_reply_to_user_id":"2829248853","id":"1497820935432380416","text":"@Painthisice Meine Mutter stammt aus einem Land in dem das Leben nicht einfach war von klein aus hatte sie ein hartes Leben doch Sie war eine Frau die mit allen Wasser gewaschen war.","created_at":"2022-02-27T06:28:33.000Z","conversation_id":"1497670154615984134"},{"author_id":"2829248853","in_reply_to_user_id":"2829248853","id":"1497670163667292171","text":"I'm just a passionate artist with pretty big dreams, a random girl in a random country and now I'm scared of the situation here in Europe: what if it's all escalating and everything you wish for will fade away - you as well? The future is such an unknown mysterious path, scary.☹️","created_at":"2022-02-26T20:29:27.000Z","conversation_id":"1497670154615984134"},{"author_id":"2829248853","in_reply_to_user_id":"2829248853","id":"1497670158252494848","text":"Dreams that always made me never giving up, I always kept hope to enjoy life as it's supposed to be: enjoyable, beautiful. I want to work at @Bungie because it feels like a home although I've never been there and I am not as good as I shall be for such a great studio.(2/3)","created_at":"2022-02-26T20:29:25.000Z","conversation_id":"1497670154615984134"}],"meta":{"newest_id":"1498047642424823809","oldest_id":"1497670158252494848","result_count":8}}