{"data":[{"author_id":"1361083361675137024","id":"1497365785026695172","conversation_id":"1497240413069058049","created_at":"2022-02-26T00:19:57.000Z","in_reply_to_user_id":"1221802128827613184","text":"@helenessex2 Sorry for your loss though I know it’s coming here soon, I’m more angry of the time and memories lost now lockdown was the last capable time we had we lost that and more because of the selfish"},{"author_id":"1361083361675137024","id":"1497334683151085573","conversation_id":"1497240413069058049","created_at":"2022-02-25T22:16:22.000Z","in_reply_to_user_id":"1221802128827613184","text":"@helenessex2 Who knows if they think for one moment we were ever really locked down they’ve led very sheltered lives.  We were told to stay home we were not locked in them, we didn’t see the army policing the streets to keep us in"},{"author_id":"1221802128827613184","id":"1497334135689564164","conversation_id":"1497240413069058049","created_at":"2022-02-25T22:14:11.000Z","in_reply_to_user_id":"1361083361675137024","text":"@Josie19752 I know I often think about that as if it were the heady days 🙃it was same storm different ships but at least it was real, we were all more genuine. News was awful but it was real, we knew where we stood &amp; had a common goal."},{"author_id":"1361083361675137024","id":"1497333561921347589","conversation_id":"1497240413069058049","created_at":"2022-02-25T22:11:54.000Z","in_reply_to_user_id":"1221802128827613184","text":"@helenessex2 Start of the pandemic we were all checking on neighbours pulling together this lot always wanted to divide that.  Those first few weeks of lockdown where we all saw each other’s struggles we should have held onto that"},{"author_id":"1221802128827613184","id":"1497315457099083785","conversation_id":"1497240413069058049","created_at":"2022-02-25T20:59:58.000Z","in_reply_to_user_id":"1361083361675137024","text":"@Josie19752 Sorry to hear about your FIL, I know my experiences give me some insight to being CEV in the pandemic but you’d hope just common decency wud be enough for most to want everyone to be as safe as poss. Are they coming in with more LD attacks poss expecting need for them soon?"},{"author_id":"1221802128827613184","id":"1497314297797652486","conversation_id":"1497240413069058049","created_at":"2022-02-25T20:55:22.000Z","in_reply_to_user_id":"1361083361675137024","text":"@Josie19752 Sadly mum passed away last spring but the vitriol for trying to look after people- I mean pre pandemic having sympathy for others &amp; acting accordingly was pretty normal? Takes my breath away. Then this stuff gets waved around obvs intention of scaring ppl &amp; giving false ideas 😒"},{"author_id":"1361083361675137024","id":"1497313457938575364","conversation_id":"1497240413069058049","created_at":"2022-02-25T20:52:01.000Z","in_reply_to_user_id":"1221802128827613184","text":"@helenessex2 Know exactly what you mean we have same circumstances with my FIL and we are doing everything we can to keep him seeing people but safely.  The last thing we need is judgement from imbeciles"},{"author_id":"1221802128827613184","id":"1497310716260409354","conversation_id":"1497240413069058049","created_at":"2022-02-25T20:41:08.000Z","in_reply_to_user_id":"1361083361675137024","text":"@Josie19752 Yet if I talk about the need to wear a mask because #COVIDisAirborne I’m  a fear mongering bedwetting 0 covid zealot. If I mentioned this in context of my mum being stage 4 cancer on chemo so I needed to keep her (&amp; customers) safe, I was told F off, stay home wear a hazmat 🤷‍♀️"}],"meta":{"newest_id":"1497365785026695172","oldest_id":"1497310716260409354","result_count":8}}