{"data":[{"id":"1502371529614667781","in_reply_to_user_id":"23820899","conversation_id":"1499880542237515778","author_id":"19747338","text":"@WFLA Deaths from COVID still steady around 1200-1300 per week. \nGet the shot--and the boost\nWear your mask\nWash your hands\nKeep your distance","created_at":"2022-03-11T19:51:00.000Z"},{"id":"1501608285077651459","in_reply_to_user_id":"23820899","conversation_id":"1499880542237515778","author_id":"1221428908790296576","text":"@WFLA \"PRESIDENT BIDEN IS IN CHARGE and not the congressman, congresswoman or governors, mayors or anyone else that thinks how we should or shouldn't lead. We voted for him because he was absolute in his determination to grow and strengthen America~\n\nKeep up the great work JOE!🇺🇸🇺🇦💪","created_at":"2022-03-09T17:18:08.000Z"},{"id":"1501587911724212227","in_reply_to_user_id":"23820899","conversation_id":"1499880542237515778","author_id":"1221428908790296576","text":"@WFLA I prefer to help the Florida Manatees survive in the waters of Florida then give Ron DeSantis another term as the worst American Governor in our lifetime!\"","created_at":"2022-03-09T15:57:10.000Z"},{"id":"1501388142770860040","in_reply_to_user_id":"23820899","conversation_id":"1499880542237515778","author_id":"1221428908790296576","text":"@WFLA He accuses us, not Putin, of starting this war. He criticizes us, our people, our democracy, but praises Putin &amp; the world’s other dictators. He always blames us when shit happens. The only conclusion to draw is that Ron DeSantis is wrong for Florida and doesn't like \nAmerica.👎","created_at":"2022-03-09T02:43:22.000Z"},{"id":"1501237963287576582","in_reply_to_user_id":"3220637312","conversation_id":"1499880542237515778","author_id":"14136304","text":"@BubbleGirlHCG @WFLA Now we get down to reasons behind judgements against other people's opinions.  I have COPD, strapping something across my face laced with chemicals  has done nothing to help my condition. No point is invalid.  This is an emotional argument. I have rights also, thank you  ;-)","created_at":"2022-03-08T16:46:36.000Z"},{"id":"1501234098941145095","in_reply_to_user_id":"3220637312","conversation_id":"1499880542237515778","author_id":"14136304","text":"@BubbleGirlHCG @WFLA I can't agree with this; it infers something I did not say.  I chose to believe that I can treat most illnesses at home.  My home has done it for 15 years w/o meds- no $$ for insurance. I lost fam/frnds to C-19, so be cautious in your assumptions.  2 were denied early treatment.","created_at":"2022-03-08T16:31:15.000Z"},{"id":"1501192275837263872","in_reply_to_user_id":"14136304","conversation_id":"1499880542237515778","author_id":"3220637312","text":"@JenniferF @ibukacca21 @WFLA It’s not about “keeping “everyone” from dying…” It’s about limiting the death and severe disease that this virus is capable of causing. We have almost a million dead Americans - and many think that’s an undercount). It didn’t have to be that bad but for the dramatics of deniers.","created_at":"2022-03-08T13:45:04.000Z"},{"id":"1501189397290569734","in_reply_to_user_id":"14136304","conversation_id":"1499880542237515778","author_id":"3220637312","text":"@JenniferF @WFLA I don’t call it “dramatics” to take simple measures to protect OTHERS as well as myself. I call it a simple act of good citizenship to care enough not to transmit this virus to others who might be more vulnerable. I call it good citizenship to protect health care workers too.","created_at":"2022-03-08T13:33:37.000Z"},{"id":"1501188455644246021","in_reply_to_user_id":"14136304","conversation_id":"1499880542237515778","author_id":"3220637312","text":"@JenniferF @WFLA Yesterday I talked with a 54 yr old male Xray tech who has PTSD after 2 years of seeing too many trashed lungs. I don’t call it dramatics to care about those health care workers suffering PTSD after two years of caring for people who might have avoided COVID with masks &amp; vaccines","created_at":"2022-03-08T13:29:53.000Z"},{"id":"1501186346991378437","in_reply_to_user_id":"14136304","conversation_id":"1499880542237515778","author_id":"3220637312","text":"@JenniferF @WFLA The reason the US has had such a high level of COVID disease and death is because too many of us have clung to the selfishness of “I feel comfortable for myself…” I don’t call it “dramatics” to care about the almost a million dead Americans and to want to prevent more death.”","created_at":"2022-03-08T13:21:30.000Z"}],"meta":{"newest_id":"1502371529614667781","oldest_id":"1501186346991378437","result_count":10,"next_token":"b26v89c19zqg8o3fpyqlnu1nptked4c4ok2fuqo2qj2wt"}}