{"data":[{"text":"@jlawhorn1975 @NGrossman81 There are 9,000 unused leases to drill for new wells, they can start with this. The US oil production is ramping up rapidly compared to 2020. There is nothing from the government side preventing oil companies from increasing their oil production to at least 2019 levels.","created_at":"2022-03-09T18:20:57.000Z","in_reply_to_user_id":"1427323740392669187","conversation_id":"1500955037039841280","author_id":"1472653252697235461","id":"1501624094294425606"},{"text":"@george_abington @NGrossman81 New wells have to be drilled to offset declines in older wells.  The decline in new wells is why US production is falling.  The political environment is discouraging deployment of capital in that direction, though that will likely change soon to some degree.","created_at":"2022-03-09T15:47:39.000Z","in_reply_to_user_id":"1472653252697235461","conversation_id":"1500955037039841280","author_id":"1427323740392669187","id":"1501585515669336068"},{"text":"@jlawhorn1975 @NGrossman81 Not a single oil well that was producing oil in 2019 is being stopped by the federal gov in 2021 or 2022. The only reason many of them were self shutdown is because oil crashed in 2020 an it was huge losses for them to produce. Now they are coming back into production.","created_at":"2022-03-08T03:33:38.000Z","in_reply_to_user_id":"1427323740392669187","conversation_id":"1500955037039841280","author_id":"1472653252697235461","id":"1501038404745768960"},{"text":"@NGrossman81 The US produced 2 MM bpd more a couple of years ago, that's not inconsequential at all in terms of oil price.  The entire world may not have more than 4 MM bpd in slack capacity.","created_at":"2022-03-07T22:31:32.000Z","in_reply_to_user_id":"3171093349","conversation_id":"1500955037039841280","author_id":"1427323740392669187","id":"1500962379621875715"},{"text":"@jlawhorn1975 That's a fairly common misconception. Oil is a global commodity, and the price of gasoline in the US fluctuates with the price of oil, not with domestic oil production. Increased supply can lower the price, but the marginal increase of US production barely affected global supply.","created_at":"2022-03-07T22:23:33.000Z","in_reply_to_user_id":"1427323740392669187","conversation_id":"1500955037039841280","author_id":"3171093349","id":"1500960368851505157"},{"text":"@NGrossman81 Senator Blackburn is trying so hard to cement her position as dumbest US Senator notwithstanding the furious competition she's facing from the junior Senator/Coach from the great state of Alabama. She's rising to the challenge.","created_at":"2022-03-07T22:10:30.000Z","in_reply_to_user_id":"3171093349","conversation_id":"1500955037039841280","author_id":"862336866","id":"1500957088499048454"},{"text":"@NGrossman81 This isn't entirely true.  US oil production peaked in the Trump admin (largely due to friendly regulatory environment), and that surely helped.  A similar environment could moderate prices within 6-9 months, but we'd apparently prefer that Saudi and Venezuela benefit instead.","created_at":"2022-03-07T22:07:42.000Z","in_reply_to_user_id":"3171093349","conversation_id":"1500955037039841280","author_id":"1427323740392669187","id":"1500956383134498821"},{"text":"@NGrossman81 Indeed. And it's super frustrating. Because it's such a cheap, obvious ploy. It would be like going 'remember when gas was cheap right before katrina?' and ignoring what happened. \n\nBut it works. And people nod and go with it.","created_at":"2022-03-07T22:07:37.000Z","in_reply_to_user_id":"3171093349","conversation_id":"1500955037039841280","author_id":"1327682759595347969","id":"1500956362033008642"},{"text":"@NGrossman81 the party that claims to be obsessed with business and want businesspeople to run the country sure seems to forgot about supply and demand and basic macro a lot. its pretty cool","created_at":"2022-03-07T22:06:41.000Z","in_reply_to_user_id":"3171093349","conversation_id":"1500955037039841280","author_id":"33368212","id":"1500956127621955584"},{"text":"@NGrossman81 Bush II enjoyed one dollar gas, and a near depression.","created_at":"2022-03-07T22:06:22.000Z","in_reply_to_user_id":"3171093349","conversation_id":"1500955037039841280","author_id":"1684286030","id":"1500956045002350596"}],"meta":{"newest_id":"1501624094294425606","oldest_id":"1500956045002350596","result_count":10,"next_token":"b26v89c19zqg8o3fpyql95gmm4hn6s1vuwpe8xgofpi0t"}}