{"data":[{"id":"1501980703948525572","author_id":"868991592622903296","conversation_id":"1500473720799961097","created_at":"2022-03-10T17:57:59.000Z","text":"@Dianekjs @JReinerMD Even if every microbe of THIS virus was erased, the immunocompromised would still be at risk by everything that existed before the pandemic.  Instead of failed policy efforts to re-engineer human nature, the best way forward is to advance treatments, not stigmatize or limit them.","in_reply_to_user_id":"374693235"},{"id":"1501615820971122693","author_id":"752061589","conversation_id":"1500473720799961097","created_at":"2022-03-09T17:48:05.000Z","text":"@BobHarig What's sad is that you latched on to the use of freedom, but failed to see the distinction between liberty, license, and freedom. \n\nIt's an indication of your ideological bent. And your unwillingness to open your mind. You didnt ask about liberty being stripped. Nor license.","in_reply_to_user_id":"275217630"},{"id":"1501615308213211142","author_id":"275217630","conversation_id":"1500473720799961097","created_at":"2022-03-09T17:46:02.000Z","text":"@Poliscikosis yeah my freedom. a public health crisis and you're worried about yourself.. and here we are.. good luck, this has been fun, and predictably, sad","in_reply_to_user_id":"752061589"},{"id":"1501614370954035203","author_id":"752061589","conversation_id":"1500473720799961097","created_at":"2022-03-09T17:42:19.000Z","text":"@BobHarig Yes.. . . Government's solution to issues is ALWAYS more government. Meanwhile, you lose in the long run because govt takes your liberty, and then your license, and then, after both are eroded, they come after your freedom.","in_reply_to_user_id":"275217630"},{"id":"1501611860629540865","author_id":"275217630","conversation_id":"1500473720799961097","created_at":"2022-03-09T17:32:20.000Z","text":"@Poliscikosis The point is that as things got worse, we did less. Our governor ignored it. Hospitals were overflowing... https://t.co/joOvQLuCZT","in_reply_to_user_id":"752061589"},{"id":"1501611080832925706","author_id":"752061589","conversation_id":"1500473720799961097","created_at":"2022-03-09T17:29:14.000Z","text":"@BobHarig Also, Noone has a test that distinguishes variants from original strain. So what source are you getting that Florida had more delta deaths than any other state?","in_reply_to_user_id":"752061589"},{"id":"1501610613704994817","author_id":"752061589","conversation_id":"1500473720799961097","created_at":"2022-03-09T17:27:23.000Z","text":"@BobHarig Vast outdoors. Glad you said that. You know, the same outdoors which gives vitamin D (THE vitamin that helps the most against covid) and all the draconian lockdowns that made it illegal to go outside. Stop defending that insanity.","in_reply_to_user_id":"275217630"},{"id":"1501609529297014790","author_id":"275217630","conversation_id":"1500473720799961097","created_at":"2022-03-09T17:23:04.000Z","text":"@Poliscikosis I live in Florida. We've had more COVID deaths since the start of the Delta variant last June than any state. We are not better off for it. We did nothing. And if it weren't for our vast space and mostly outdoors, it would have been way worse. Please. Don't insult","in_reply_to_user_id":"752061589"},{"id":"1501607708671320066","author_id":"752061589","conversation_id":"1500473720799961097","created_at":"2022-03-09T17:15:50.000Z","text":"@BobHarig In Texas we did very little. And we are better off for it. Same with Sweden. Same in Florida. The places that did the most to cancel the virus, ended up with the worst conditions. NY, NJ, CA, etc. \n\nThis is all objective reality man.","in_reply_to_user_id":"275217630"},{"id":"1501599519464697867","author_id":"275217630","conversation_id":"1500473720799961097","created_at":"2022-03-09T16:43:18.000Z","text":"@Poliscikosis There's a difference between lockdowns and doing nothing. In a lot of places, we did nothing. And in certain sectors, vaccine mandates worked. Most people did it because they realized it was silly not to.","in_reply_to_user_id":"752061589"}],"meta":{"newest_id":"1501980703948525572","oldest_id":"1501599519464697867","result_count":10,"next_token":"b26v89c19zqg8o3fpyqlo2kv852rzfvcwzn5l0w0v10fx"}}