{"data":[{"conversation_id":"1498426431554031617","in_reply_to_user_id":"4512162438","author_id":"1300990548996755456","created_at":"2022-03-01T15:13:49.000Z","text":"@snarkyblackgurl “Covid misinformation” girl get real, the CDC and the US government have been giving out misinformation since the beginning. #WakeUp","id":"1498677899251048451"},{"conversation_id":"1498426431554031617","in_reply_to_user_id":"4512162438","author_id":"1300990548996755456","created_at":"2022-03-01T15:12:38.000Z","text":"@snarkyblackgurl If this is what offends you in current events your priorities are whacked as fuck. Grow up, gain a sense or humor, and stop being an egomaniac. You’re feelings aren’t the end all be all.","id":"1498677599740076032"},{"conversation_id":"1498426431554031617","in_reply_to_user_id":"4512162438","author_id":"4512162438","created_at":"2022-02-28T22:58:46.000Z","text":"That’s $10,000,000 per year… lost to a few laughs and a Chingy meme.\n•\nIt seems that this black history month has been a true testament of the old negro spiritual that goes: “fuck around and find out.” All jokes aside white American, please do better than John Dempsey has. ✨💋","id":"1498432519900778499"},{"conversation_id":"1498426431554031617","in_reply_to_user_id":"4512162438","author_id":"4512162438","created_at":"2022-02-28T22:58:46.000Z","text":"Instead of apologizing John should have just come out with a reel rapping ‘Right thurr’ while doing the chicken head in solidarity with the people, and maybe he could have kept his extremely substantial salary. According to reports, Dempsey’s lost a breathtaking $10,000,000. ✨💋","id":"1498432519015854080"},{"conversation_id":"1498426431554031617","in_reply_to_user_id":"4512162438","author_id":"4512162438","created_at":"2022-02-28T22:58:46.000Z","text":"If I were Chingy I would monitor the potential damage this type of false claim has caused his brand since he is a working artist — and to have his name cross referenced with COVID misinformation could damage his potential to further book paid engagements, affecting his coin. ✨💋","id":"1498432518105690116"},{"conversation_id":"1498426431554031617","in_reply_to_user_id":"4512162438","author_id":"4512162438","created_at":"2022-02-28T22:58:46.000Z","text":"Sources claim Estée Lauder is making it a requirement in the upcoming weeks to address all team questions relating to the current faux pas. I’m also sure they’ll be updating their social media policy to create a clause that address COVID misinformation, and — sighs — Chingy. ✨💋","id":"1498432516985815040"}],"meta":{"newest_id":"1498677899251048451","oldest_id":"1498432516985815040","result_count":6}}