{"data":[{"conversation_id":"1499024722322939914","in_reply_to_user_id":"888118103095115780","author_id":"1492899555842707465","created_at":"2022-03-03T04:31:27.000Z","text":"@RobinBrooksIIF @_VinoP ⚡️ As a French in 🇬🇧, the Euro may not survive this crisis, if it goes global and much longer…","id":"1499241014820847623"},{"conversation_id":"1499024722322939914","in_reply_to_user_id":"155696776","author_id":"155696776","created_at":"2022-03-03T03:34:36.000Z","text":"@t89500729 @RobinBrooksIIF It won't be immediate and it won't be pretty. But it's likely to lift the overall capacity of the European economy significantly more over the medium term than austerity has done over the last decade - and my point is, that effect is not yet fully seen and appreciated.","id":"1499226709945724948"},{"conversation_id":"1499024722322939914","in_reply_to_user_id":"155696776","author_id":"155696776","created_at":"2022-03-03T03:33:41.000Z","text":"@t89500729 @RobinBrooksIIF Now that's not a model that works always and forever. In the US and Europe it ran into trouble in the 70s, in Japan in the 90s, in China arguably right around now. But the thing is, Europe has seen well over a decade of far too little demand and investment. So it needs that now.","id":"1499226479225360387"},{"conversation_id":"1499024722322939914","in_reply_to_user_id":"155696776","author_id":"155696776","created_at":"2022-03-03T03:32:36.000Z","text":"@t89500729 @RobinBrooksIIF That's not an over-night thing. But over a couple of years - or even a decade - it's very powerful. China and Japan have each done it successfully for several decades. The US has too, in WWII, and so has Europe after the war.","id":"1499226206201425933"},{"conversation_id":"1499024722322939914","in_reply_to_user_id":"155696776","author_id":"155696776","created_at":"2022-03-03T03:30:47.000Z","text":"@t89500729 @RobinBrooksIIF Plus, with all the current inflation scare, we can't forget thag by far the largest contributor is *still* energy and that's an external shock. It'll erode purchasing power, but by stimulating the economy, you'll build up a stronger supply side and will increase efficiency.","id":"1499225750825746436"},{"conversation_id":"1499024722322939914","in_reply_to_user_id":"1392509881433956355","author_id":"155696776","created_at":"2022-03-03T03:29:37.000Z","text":"@t89500729 @RobinBrooksIIF Oh absolutely it will. But that can be fixed with more government spending - and financial repression. It's already happening. Basically, it's capital owners “paying” through higher inflation for higher investment and more spending power of the people.","id":"1499225455475535874"},{"conversation_id":"1499024722322939914","in_reply_to_user_id":"1392509881433956355","author_id":"1392509881433956355","created_at":"2022-03-02T22:37:13.000Z","text":"@benbawan @RobinBrooksIIF What is your argument for why big inflation won’t chip away the buying power of extra gov spending? \n\nMy perspective is that even greater $/€ chasing a limited goods in a supply blocked world probably will cause excess inflation","id":"1499151868764823553"},{"conversation_id":"1499024722322939914","in_reply_to_user_id":"155696776","author_id":"1392509881433956355","created_at":"2022-03-02T22:34:43.000Z","text":"@benbawan @RobinBrooksIIF I understand that gov spending can grow an economy, in some ways this is China’s model or the US quantitative easing since 2008. But Robin’s point is inflation is coming and it is at a level it cannot be ignored (eg 7.5% in US) so taking more debt won’t fix things","id":"1499151241049485316"},{"conversation_id":"1499024722322939914","in_reply_to_user_id":"155696776","author_id":"155696776","created_at":"2022-03-02T19:05:55.000Z","text":"@t89500729 @RobinBrooksIIF And yes, this will turbocharge demand and then in due time also supply if maintained for a while. Higher energy prices will hurt, but we can invest our way out of this, if we keep at it. Meanwhile, the rest of the world keeps buying stuff too.","id":"1499098693546524679"},{"conversation_id":"1499024722322939914","in_reply_to_user_id":"155696776","author_id":"155696776","created_at":"2022-03-02T19:05:06.000Z","text":"@t89500729 @RobinBrooksIIF The third part is important because Europe has a habit of falling into growth-crimping austerity. But with everything going on, this has become much less likely. Together with financial suppression, we'll probably see much higher spending across the board.","id":"1499098489485205506"}],"meta":{"newest_id":"1499241014820847623","oldest_id":"1499098489485205506","result_count":10,"next_token":"b26v89c19zqg8o3fpe78o8lbknhgijsbddri49zg119bx"}}