{"data":[{"author_id":"1492728091835342856","id":"1501594710787436544","conversation_id":"1500995905339731974","in_reply_to_user_id":"1492728091835342856","text":"@KevinJTraceyMD @Nature We have both been referred to Neurology because if the constant muscle spasms/twitches. ENT at Bedford hospital were a joke, Consultant's nowadays don't have a questioning scientific mind or just don't care. There must be so many people with these symptoms!!!","created_at":"2022-03-09T16:24:11.000Z"},{"author_id":"1492728091835342856","id":"1501593774623019010","conversation_id":"1500995905339731974","in_reply_to_user_id":"3064288438","text":"@KevinJTraceyMD @Nature My partner and I both have neurological and brain pressure symptoms. I even suggested it seemed like encephalitis but no one will listen. He now has aeroplane ear and extreme deafness but has not flown! I will not shut up about this, worked for Unilever to my shame, Monoclonals","created_at":"2022-03-09T16:20:28.000Z"},{"author_id":"1246694258989346816","id":"1501394615034777600","conversation_id":"1500995905339731974","in_reply_to_user_id":"3064288438","text":"@KevinJTraceyMD @Nature The neuronal loss could be the result of long standing poor blood supply secondary to microclots with chronic endotheliitis of minute vessels in the brain, cant rule out the direct deleterious effect of SARS-CoV-2 to the neuron itself which cause the neurons to die.","created_at":"2022-03-09T03:09:05.000Z"},{"author_id":"3213111621","id":"1501190294792019974","conversation_id":"1500995905339731974","in_reply_to_user_id":"41038352","text":"@Dysautonomia @KevinJTraceyMD @Nature @Dysautonomia also will be interesting to know ApoE4 status of study subjects when these studies come to fruition. #APOE4 status is currently linked to compromised brain recovery from insults, both physical and infectious.","created_at":"2022-03-08T13:37:11.000Z"},{"author_id":"41038352","id":"1501181527404818441","conversation_id":"1500995905339731974","in_reply_to_user_id":"3064288438","text":"@KevinJTraceyMD @Nature Would be really interesting to look for this after other viral infections. Perhaps this is common after viral infections. All of this great research on COVID needs to be applied to other post-viral syndromes that have suffered from a lack of funding for decades.","created_at":"2022-03-08T13:02:21.000Z"},{"author_id":"2980638659","id":"1500998567342886925","conversation_id":"1500995905339731974","in_reply_to_user_id":"3064288438","text":"@KevinJTraceyMD @Nature Chronic pain can thin grey matter too.","created_at":"2022-03-08T00:55:20.000Z"}],"meta":{"newest_id":"1501594710787436544","oldest_id":"1500998567342886925","result_count":6}}