{"data":[{"created_at":"2022-03-07T13:38:41.000Z","author_id":"1475882017913020428","conversation_id":"1500596794627084290","text":"@ajlamesa @ProfMBassetti I personally go somewhere else for \"holidays\"... somewhere with no masks or other restrictions.","in_reply_to_user_id":"277851432","id":"1500828281683251200"},{"created_at":"2022-03-07T12:38:08.000Z","author_id":"1328436721369944065","conversation_id":"1500596794627084290","text":"@rickypi92 @ajlamesa @ProfMBassetti I'm sorry. Your country has been treated shamefully by the politicians.","in_reply_to_user_id":"1413075969632522243","id":"1500813045915922433"},{"created_at":"2022-03-07T07:00:23.000Z","author_id":"1413075969632522243","conversation_id":"1500596794627084290","text":"@ajlamesa @ProfMBassetti For anyone reading, I’ll tell you this: if you want to come to Italy for tourism you should go everywhere else because we don’t deserve your money, your time and so on because of the insanity of our minister of health. I’m not saying this lightly I love my country but that’s it.","in_reply_to_user_id":"277851432","id":"1500728048827924481"},{"created_at":"2022-03-07T04:45:13.000Z","author_id":"1433676113658593283","conversation_id":"1500596794627084290","text":"@ajlamesa @Alicia_Smith19 @ProfMBassetti Indeed, I wound up last visiting Albania and did not regret it one bit. It is beautiful, fascinating, and friendly. \n\nHere is one of Tirana's nice dining streets looks like, covered in fragrant Linden trees. Beach was sublime. Mountains amazing. No COVID restrictions at all. https://t.co/eINGEIBczV","in_reply_to_user_id":"277851432","id":"1500694034355929092"},{"created_at":"2022-03-07T04:37:32.000Z","author_id":"1433676113658593283","conversation_id":"1500596794627084290","text":"@ajlamesa @ProfMBassetti 3x vaccinated here. I also adore Italy, and have been a few times, wanting to go explore more. I will not, however, pay money to wear a mask and prove my health to every gelato vendor. I can do that here in San Francisco. When Italy decides to relax, I look forward to returning!","in_reply_to_user_id":"277851432","id":"1500692100387459076"},{"created_at":"2022-03-06T22:30:30.000Z","author_id":"15336136","conversation_id":"1500596794627084290","text":"@ajlamesa @ProfMBassetti I'm forced to wear a N95/FFP2 every time I take public transport (~1h) plus at work (I'm an open office space, *must* wear one even when there's just another person in the room seven or eight meters away from me) for several hours straight. I don't want to see masks for leisure.","in_reply_to_user_id":"277851432","id":"1500599733336875011"},{"created_at":"2022-03-06T22:28:43.000Z","author_id":"277851432","conversation_id":"1500596794627084290","text":"@gstarwind @ProfMBassetti Yes, I have been vaccinated, boosted, and probably had Covid at the beginning of the pandemic. I enjoy being in a place where I can walk outside the hotel room or apartment without having to worry about a mask and green pass, in addition to my wallet and backpack.","in_reply_to_user_id":"15336136","id":"1500599282562387972"},{"created_at":"2022-03-06T22:27:12.000Z","author_id":"277851432","conversation_id":"1500596794627084290","text":"@Alicia_Smith19 @ProfMBassetti It's not just Italy, but also Portugal and, to a lesser degree, Spain. Mediterranean Europe should celebrate having some of the highest vaccination rates in the world.","in_reply_to_user_id":"2319141767","id":"1500598902311034881"},{"created_at":"2022-03-06T22:26:41.000Z","author_id":"15336136","conversation_id":"1500596794627084290","text":"@ajlamesa @ProfMBassetti I'm not staying in Italy this summer for my holidays. I want to go somewhere where I can stop using masks and tell everyone my health status.","in_reply_to_user_id":"277851432","id":"1500598771230593024"},{"created_at":"2022-03-06T22:21:33.000Z","author_id":"2319141767","conversation_id":"1500596794627084290","text":"@ajlamesa @ProfMBassetti The Italian health minister is a mess and I don’t see him changing course anytime soon, unfortunately. The fact that one of the most highly vaccinated countries in Europe is still enforcing restrictions is really disappointing","in_reply_to_user_id":"277851432","id":"1500597478994944002"}],"meta":{"newest_id":"1500828281683251200","oldest_id":"1500597478994944002","result_count":10}}