{"data":[{"in_reply_to_user_id":"357396551","author_id":"357396551","created_at":"2022-03-11T15:02:06.000Z","id":"1502298826572705798","text":"@amrisolarstreak @tiotheo01 There is a catalogue of issues like these, that not only have undermined faith in institutions, but also wrongfully penalised and stigmatised those that didn't toe the line or voiced these concerns.","conversation_id":"1500627518092496896"},{"in_reply_to_user_id":"56904816","author_id":"357396551","created_at":"2022-03-11T14:59:03.000Z","id":"1502298060080422913","text":"@amrisolarstreak @tiotheo01 Fair enough. But we knew long ago that vaccines didn't significantly reduce transmission, wane after 3 months, denied/downplayed natural immunity, dismissed adverse effects (myocarditis in particular), ignored how severity was correlated to age and comorbidities. Prior to Omicron","conversation_id":"1500627518092496896"},{"in_reply_to_user_id":"357396551","author_id":"56904816","created_at":"2022-03-11T13:56:37.000Z","id":"1502282348997808131","text":"@volatyl3 @tiotheo01 The counterproductive part - I can see what you mean there.\n\nBut remember when Omicron starts, people all around the world panicking, country close borders etc. It’s only after a while that we know and certain about its properties and countries start reopening.","conversation_id":"1500627518092496896"},{"in_reply_to_user_id":"56904816","author_id":"357396551","created_at":"2022-03-11T09:37:48.000Z","id":"1502217216624041987","text":"@amrisolarstreak @tiotheo01 This is true. Which is why countries ahead of the curve with Omicron have started to distinguish between incidental covid hospitalisations.\n\nBut we aren't doing that here, because it would be counterproductive to the vaccine policy objective. Which imo is redundant with Omicron.","conversation_id":"1500627518092496896"},{"in_reply_to_user_id":"56904816","author_id":"357396551","created_at":"2022-03-11T08:05:39.000Z","id":"1502194023016316929","text":"@amrisolarstreak @tiotheo01 But that is a conundrum in itself. The virus comes in waves, with it being hard to prove as to whether peaks or declines are tied to vaccine rollouts or coincidental. Israel has this pattern, but on a 4th shot.\n\nVaccines may help high risks. But I'm not sure it explains the wave","conversation_id":"1500627518092496896"},{"in_reply_to_user_id":"56904816","author_id":"953601964511645698","created_at":"2022-03-11T08:03:28.000Z","id":"1502193475109875715","text":"@amrisolarstreak The new variant is supposed to be milder though, albeit more contagious. I'd accept this explanation if we're talking about cases here, but this is hospitalization... So... your point doesn't really hold water. Unless, the vaccines somehow made people more susceptible?","conversation_id":"1500627518092496896"},{"in_reply_to_user_id":"56904816","author_id":"56904816","created_at":"2022-03-11T08:03:08.000Z","id":"1502193390686900226","text":"@tiotheo01 \"Increase transmisability but less virulent pathology\" is why we see the new cases is very high, but ICU cases was not as high as before. https://t.co/IqOGMM3D0h","conversation_id":"1500627518092496896"},{"in_reply_to_user_id":"953601964511645698","author_id":"56904816","created_at":"2022-03-11T08:00:54.000Z","id":"1502192827060473857","text":"@tiotheo01 I was going to say but this reply had said it. It peak because of new variant. You can also observe that country like UK peak earlier as Omicron was more prevalent there in December 21\n\n https://t.co/IbcFTYvrs9","conversation_id":"1500627518092496896"},{"in_reply_to_user_id":"56904816","author_id":"357396551","created_at":"2022-03-11T07:56:48.000Z","id":"1502191797715763200","text":"@amrisolarstreak @tiotheo01 March has probably little to nothing to do with the vaccine themselves, but more to do with the variant being far milder. Conversely this variant evades vaccine antibodies, but as trade off for this it has increased transmisability but less virulent pathology.","conversation_id":"1500627518092496896"},{"in_reply_to_user_id":"56904816","author_id":"953601964511645698","created_at":"2022-03-11T07:54:44.000Z","id":"1502191275142881282","text":"@amrisolarstreak Okay, I'll acknowledge that. \n\nLet's hear your point then.","conversation_id":"1500627518092496896"}],"meta":{"newest_id":"1502298826572705798","oldest_id":"1502191275142881282","result_count":10,"next_token":"b26v89c19zqg8o3fpyqm2znw7pm7uxbrfr9onzxxhetml"}}