{"data":[{"conversation_id":"1500766352319123456","text":"@gnomeicide Sadly the message that's got through is masks are unnecessary. My elderly parents seem happy to sit unmasked in a theatre with 200 people, go to church or pub, where even the serving staff are unmasked. It's not going to end well.","author_id":"515825843","created_at":"2022-03-07T12:16:17.000Z","id":"1500807545597972480","in_reply_to_user_id":"177199690"},{"conversation_id":"1500766352319123456","text":"@gnomeicide I just feel the Ukraine invasion we have had no information at all, nobody is paying attention anymore.  Obviously, the gov have moved on and we are not going to have any restrictions reimbursed. Steve Baker M.P. wouldn't allow it! I continue to mask, vax and hope for the best!","author_id":"59736659","created_at":"2022-03-07T10:57:45.000Z","id":"1500787784533037059","in_reply_to_user_id":"177199690"},{"conversation_id":"1500766352319123456","text":"Mass infection may follow soon, in fact looking at  trends its likely happening now. That creates the conditions for more dangerous forms of Covid to arise. We have a problem, ignoring it won't make it go away, its now just a matter of how long it takes us to realise that (fin)","author_id":"177199690","created_at":"2022-03-07T10:08:49.000Z","id":"1500775468550823937","in_reply_to_user_id":"177199690"},{"conversation_id":"1500766352319123456","text":"It will not have escaped your attention that we're also in the midst of a fuel price crisis. For all sorts of reasons we need to go back to a working at home if possible mandate. It will save lives, and it will save fuel (20)","author_id":"177199690","created_at":"2022-03-07T10:08:49.000Z","id":"1500775466814394370","in_reply_to_user_id":"177199690"},{"conversation_id":"1500766352319123456","text":"So what do we do now? Well I should think its obvious. What we were doing was working reasonably well, but not as well as we'd have hoped. We need masks back. Thats urgent (19)","author_id":"177199690","created_at":"2022-03-07T10:08:48.000Z","id":"1500775464176074754","in_reply_to_user_id":"177199690"},{"conversation_id":"1500766352319123456","text":"And I've got to say I don't like where this trend is going - last year we were rightly angry about how many were dying. We're rapidly on course to get to a worse place (18) https://t.co/Q4hlaH3G9C","author_id":"177199690","created_at":"2022-03-07T10:08:47.000Z","id":"1500775461365944324","in_reply_to_user_id":"177199690"},{"conversation_id":"1500766352319123456","text":"Deaths are rising as a proportion of infection. Thats either because we're starting to see immunity from vaccination fall, or we're not catching as many infections through testing. (17) https://t.co/xDbiLN4b6T","author_id":"177199690","created_at":"2022-03-07T10:08:46.000Z","id":"1500775457163202562","in_reply_to_user_id":"177199690"},{"conversation_id":"1500766352319123456","text":"We've done the same thing with reopening now, but in Winter. The gains we had made, the good direction we were going in (although too slowly), that has ended now. But its in the relationship between these markers that the real problem emerges (16)","author_id":"177199690","created_at":"2022-03-07T09:55:49.000Z","id":"1500772196951724033","in_reply_to_user_id":"177199690"},{"conversation_id":"1500766352319123456","text":"Last summer things turned around when we opened up in July. We saw a slow rise in cases that soon led to mass infection that created the Alpha strain of Covid, and a far more rapid acceleration from an already bad place into Autumn (15)","author_id":"177199690","created_at":"2022-03-07T09:55:48.000Z","id":"1500772194531647497","in_reply_to_user_id":"177199690"},{"conversation_id":"1500766352319123456","text":"And while deaths lag further behind, deaths follow hospitalisations (14) https://t.co/I3av12xSsz","author_id":"177199690","created_at":"2022-03-07T09:55:47.000Z","id":"1500772191033606146","in_reply_to_user_id":"177199690"}],"meta":{"newest_id":"1500807545597972480","oldest_id":"1500772191033606146","result_count":10,"next_token":"b26v89c19zqg8o3fpyql917rq91mmarxb7t2rh76sxta5"}}